/*------------------------------prevent recursive inclusion -------------------*/ 
#ifndef __SNR_BLDC_HALL_V1p0_H
#define __SNR_BLDC_HALL_V1p0_H

#include "basic.h"

//*---------------------------------------------------------*//
//	该结构体不允许做任何改动, 否则会失控
//*---------------------------------------------------------*//
typedef struct
{
	__IO  uint8_t		u8HALL_NEW_Value;	
} HALL_NEWVALUE_TypeDef;
extern	HALL_NEWVALUE_TypeDef	HALL_LIB;
//*---------------------------------------------------------*//
//	该结构体不允许做任何改动, 否则会失控
//*---------------------------------------------------------*//
#endif

//-----------------------------------------------------------------------------------------------


